ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_prot.h
/* ===================================================  PROT_SMPU.MS0_CTL  =================================================== */
#define PROT_SMPU_MS0_CTL_P_Pos           (0UL)                 /*!< PROT_SMPU MS0_CTL: P (Bit 0)                              */
#define PROT_SMPU_MS0_CTL_P_Msk           (0x1UL)               /*!< PROT_SMPU MS0_CTL: P (Bitfield-Mask: 0x01)                */
#define PROT_SMPU_MS0_CTL_NS_Pos          (1UL)                 /*!< PROT_SMPU MS0_CTL: NS (Bit 1)                             */
#define PROT_SMPU_MS0_CTL_NS_Msk          (0x2UL)               /*!< PROT_SMPU MS0_CTL: NS (Bitfield-Mask: 0x01)               */
#define PROT_SMPU_MS0_CTL_PRIO_Pos        (8UL)                 /*!< PROT_SMPU MS0_CTL: PRIO (Bit 8)                           */
#define PROT_SMPU_MS0_CTL_PRIO_Msk        (0x300UL)             /*!< PROT_SMPU MS0_CTL: PRIO (Bitfield-Mask: 0x03)             */
#define PROT_SMPU_MS0_CTL_PC_MASK_0_Pos   (16UL)                /*!< PROT_SMPU MS0_CTL: PC_MASK_0 (Bit 16)                     */
#define PROT_SMPU_MS0_CTL_PC_MASK_0_Msk   (0x10000UL)           /*!< PROT_SMPU MS0_CTL: PC_MASK_0 (Bitfield-Mask: 0x01)        */
#define PROT_SMPU_MS0_CTL_PC_MASK_15_TO_1_Pos (17UL)            /*!< PROT_SMPU MS0_CTL: PC_MASK_15_TO_1 (Bit 17)               */
#define PROT_SMPU_MS0_CTL_PC_MASK_15_TO_1_Msk (0xfffe0000UL)    /*!< PROT_SMPU MS0_CTL: PC_MASK_15_TO_1 (Bitfield-Mask: 0x7fff)*/
/* ===================================================  PROT_SMPU.MS1_CTL  =================================================== */
#define PROT_SMPU_MS1_CTL_P_Pos           (0UL)                 /*!< PROT_SMPU MS1_CTL: P (Bit 0)                              */
#define PROT_SMPU_MS1_CTL_P_Msk           (0x1UL)               /*!< PROT_SMPU MS1_CTL: P (Bitfield-Mask: 0x01)                */
#define PROT_SMPU_MS1_CTL_NS_Pos          (1UL)                 /*!< PROT_SMPU MS1_CTL: NS (Bit 1)                             */
#define PROT_SMPU_MS1_CTL_NS_Msk          (0x2UL)               /*!< PROT_SMPU MS1_CTL: NS (Bitfield-Mask: 0x01)               */
#define PROT_SMPU_MS1_CTL_PRIO_Pos        (8UL)                 /*!< PROT_SMPU MS1_CTL: PRIO (Bit 8)                           */
#define PROT_SMPU_MS1_CTL_PRIO_Msk        (0x300UL)             /*!< PROT_SMPU MS1_CTL: PRIO (Bitfield-Mask: 0x03)             */
#define PROT_SMPU_MS1_CTL_PC_MASK_0_Pos   (16UL)                /*!< PROT_SMPU MS1_CTL: PC_MASK_0 (Bit 16)                     */
#define PROT_SMPU_MS1_CTL_PC_MASK_0_Msk   (0x10000UL)           /*!< PROT_SMPU MS1_CTL: PC_MASK_0 (Bitfield-Mask: 0x01)        */
#define PROT_SMPU_MS1_CTL_PC_MASK_15_TO_1_Pos (17UL)            /*!< PROT_SMPU MS1_CTL: PC_MASK_15_TO_1 (Bit 17)               */
#define PROT_SMPU_MS1_CTL_PC_MASK_15_TO_1_Msk (0xfffe0000UL)    /*!< PROT_SMPU MS1_CTL: PC_MASK_15_TO_1 (Bitfield-Mask: 0x7fff)*/
/* ===================================================  PROT_SMPU.MS2_CTL  =================================================== */
#define PROT_SMPU_MS2_CTL_P_Pos           (0UL)                 /*!< PROT_SMPU MS2_CTL: P (Bit 0)                              */
#define PROT_SMPU_MS2_CTL_P_Msk           (0x1UL)               /*!< PROT_SMPU MS2_CTL: P (Bitfield-Mask: 0x01)                */
#define PROT_SMPU_MS2_CTL_NS_Pos          (1UL)                 /*!< PROT_SMPU MS2_CTL: NS (Bit 1)                             */
#define PROT_SMPU_MS2_CTL_NS_Msk          (0x2UL)               /*!< PROT_SMPU MS2_CTL: NS (Bitfield-Mask: 0x01)               */
#define PROT_SMPU_MS2_CTL_PRIO_Pos        (8UL)                 /*!< PROT_SMPU MS2_CTL: PRIO (Bit 8)                           */
#define PROT_SMPU_MS2_CTL_PRIO_Msk        (0x300UL)             /*!< PROT_SMPU MS2_CTL: PRIO (Bitfield-Mask: 0x03)             */
#define PROT_SMPU_MS2_CTL_PC_MASK_0_Pos   (16UL)                /*!< PROT_SMPU MS2_CTL: PC_MASK_0 (Bit 16)                     */
#define PROT_SMPU_MS2_CTL_PC_MASK_0_Msk   (0x10000UL)           /*!< PROT_SMPU MS2_CTL: PC_MASK_0 (Bitfield-Mask: 0x01)        */
#define PROT_SMPU_MS2_CTL_PC_MASK_15_TO_1_Pos (17UL)            /*!< PROT_SMPU MS2_CTL: PC_MASK_15_TO_1 (Bit 17)               */
#define PROT_SMPU_MS2_CTL_PC_MASK_15_TO_1_Msk (0xfffe0000UL)    /*!< PROT_SMPU MS2_CTL: PC_MASK_15_TO_1 (Bitfield-Mask: 0x7fff)*/
/* ===================================================  PROT_SMPU.MS3_CTL  =================================================== */
#define PROT_SMPU_MS3_CTL_P_Pos           (0UL)                 /*!< PROT_SMPU MS3_CTL: P (Bit 0)                              */
#define PROT_SMPU_MS3_CTL_P_Msk           (0x1UL)               /*!< PROT_SMPU MS3_CTL: P (Bitfield-Mask: 0x01)                */
#define PROT_SMPU_MS3_CTL_NS_Pos          (1UL)                 /*!< PROT_SMPU MS3_CTL: NS (Bit 1)                             */
#define PROT_SMPU_MS3_CTL_NS_Msk          (0x2UL)               /*!< PROT_SMPU MS3_CTL: NS (Bitfield-Mask: 0x01)               */
#define PROT_SMPU_MS3_CTL_PRIO_Pos        (8UL)                 /*!< PROT_SMPU MS3_CTL: PRIO (Bit 8)                           */
#define PROT_SMPU_MS3_CTL_PRIO_Msk        (0x300UL)             /*!< PROT_SMPU MS3_CTL: PRIO (Bitfield-Mask: 0x03)             */
#define PROT_SMPU_MS3_CTL_PC_MASK_0_Pos   (16UL)                /*!< PROT_SMPU MS3_CTL: PC_MASK_0 (Bit 16)                     */
#define PROT_SMPU_MS3_CTL_PC_MASK_0_Msk   (0x10000UL)           /*!< PROT_SMPU MS3_CTL: PC_MASK_0 (Bitfield-Mask: 0x01)        */
#define PROT_SMPU_MS3_CTL_PC_MASK_15_TO_1_Pos (17UL)            /*!< PROT_SMPU MS3_CTL: PC_MASK_15_TO_1 (Bit 17)               */
#define PROT_SMPU_MS3_CTL_PC_MASK_15_TO_1_Msk (0xfffe0000UL)    /*!< PROT_SMPU MS3_CTL: PC_MASK_15_TO_1 (Bitfield-Mask: 0x7fff)*/
/* ===================================================  PROT_SMPU.MS4_CTL  =================================================== */
#define PROT_SMPU_MS4_CTL_P_Pos           (0UL)                 /*!< PROT_SMPU MS4_CTL: P (Bit 0)                              */
#define PROT_SMPU_MS4_CTL_P_Msk           (0x1UL)               /*!< PROT_SMPU MS4_CTL: P (Bitfield-Mask: 0x01)                */
#define PROT_SMPU_MS4_CTL_NS_Pos          (1UL)                 /*!< PROT_SMPU MS4_CTL: NS (Bit 1)                             */
#define PROT_SMPU_MS4_CTL_NS_Msk          (0x2UL)               /*!< PROT_SMPU MS4_CTL: NS (Bitfield-Mask: 0x01)               */
#define PROT_SMPU_MS4_CTL_PRIO_Pos        (8UL)                 /*!< PROT_SMPU MS4_CTL: PRIO (Bit 8)                           */
#define PROT_SMPU_MS4_CTL_PRIO_Msk        (0x300UL)             /*!< PROT_SMPU MS4_CTL: PRIO (Bitfield-Mask: 0x03)             */
#define PROT_SMPU_MS4_CTL_PC_MASK_0_Pos   (16UL)                /*!< PROT_SMPU MS4_CTL: PC_MASK_0 (Bit 16)                     */
#define PROT_SMPU_MS4_CTL_PC_MASK_0_Msk   (0x10000UL)           /*!< PROT_SMPU MS4_CTL: PC_MASK_0 (Bitfield-Mask: 0x01)        */
#define PROT_SMPU_MS4_CTL_PC_MASK_15_TO_1_Pos (17UL)            /*!< PROT_SMPU MS4_CTL: PC_MASK_15_TO_1 (Bit 17)               */
#define PROT_SMPU_MS4_CTL_PC_MASK_15_TO_1_Msk (0xfffe0000UL)    /*!< PROT_SMPU MS4_CTL: PC_MASK_15_TO_1 (Bitfield-Mask: 0x7fff)*/
/* ===================================================  PROT_SMPU.MS5_CTL  =================================================== */
#define PROT_SMPU_MS5_CTL_P_Pos           (0UL)                 /*!< PROT_SMPU MS5_CTL: P (Bit 0)                              */
#define PROT_SMPU_MS5_CTL_P_Msk           (0x1UL)               /*!< PROT_SMPU MS5_CTL: P (Bitfield-Mask: 0x01)                */
#define PROT_SMPU_MS5_CTL_NS_Pos          (1UL)                 /*!< PROT_SMPU MS5_CTL: NS (Bit 1)                             */
#define PROT_SMPU_MS5_CTL_NS_Msk          (0x2UL)               /*!< PROT_SMPU MS5_CTL: NS (Bitfield-Mask: 0x01)               */
#define PROT_SMPU_MS5_CTL_PRIO_Pos        (8UL)                 /*!< PROT_SMPU MS5_CTL: PRIO (Bit 8)                           */
#define PROT_SMPU_MS5_CTL_PRIO_Msk        (0x300UL)             /*!< PROT_SMPU MS5_CTL: PRIO (Bitfield-Mask: 0x03)             */
#define PROT_SMPU_MS5_CTL_PC_MASK_0_Pos   (16UL)                /*!< PROT_SMPU MS5_CTL: PC_MASK_0 (Bit 16)                     */
#define PROT_SMPU_MS5_CTL_PC_MASK_0_Msk   (0x10000UL)           /*!< PROT_SMPU MS5_CTL: PC_MASK_0 (Bitfield-Mask: 0x01)        */
#define PROT_SMPU_MS5_CTL_PC_MASK_15_TO_1_Pos (17UL)            /*!< PROT_SMPU MS5_CTL: PC_MASK_15_TO_1 (Bit 17)               */
#define PROT_SMPU_MS5_CTL_PC_MASK_15_TO_1_Msk (0xfffe0000UL)    /*!< PROT_SMPU MS5_CTL: PC_MASK_15_TO_1 (Bitfield-Mask: 0x7fff)*/
/* ===================================================  PROT_SMPU.MS6_CTL  =================================================== */
#define PROT_SMPU_MS6_CTL_P_Pos           (0UL)                 /*!< PROT_SMPU MS6_CTL: P (Bit 0)                              */
#define PROT_SMPU_MS6_CTL_P_Msk           (0x1UL)               /*!< PROT_SMPU MS6_CTL: P (Bitfield-Mask: 0x01)                */
#define PROT_SMPU_MS6_CTL_NS_Pos          (1UL)                 /*!< PROT_SMPU MS6_CTL: NS (Bit 1)                             */
#define PROT_SMPU_MS6_CTL_NS_Msk          (0x2UL)               /*!< PROT_SMPU MS6_CTL: NS (Bitfield-Mask: 0x01)               */
#define PROT_SMPU_MS6_CTL_PRIO_Pos        (8UL)                 /*!< PROT_SMPU MS6_CTL: PRIO (Bit 8)                           */
#define PROT_SMPU_MS6_CTL_PRIO_Msk        (0x300UL)             /*!< PROT_SMPU MS6_CTL: PRIO (Bitfield-Mask: 0x03)             */
#define PROT_SMPU_MS6_CTL_PC_MASK_0_Pos   (16UL)                /*!< PROT_SMPU MS6_CTL: PC_MASK_0 (Bit 16)                     */
#define PROT_SMPU_MS6_CTL_PC_MASK_0_Msk   (0x10000UL)           /*!< PROT_SMPU MS6_CTL: PC_MASK_0 (Bitfield-Mask: 0x01)        */
#define PROT_SMPU_MS6_CTL_PC_MASK_15_TO_1_Pos (17UL)            /*!< PROT_SMPU MS6_CTL: PC_MASK_15_TO_1 (Bit 17)               */
#define PROT_SMPU_MS6_CTL_PC_MASK_15_TO_1_Msk (0xfffe0000UL)    /*!< PROT_SMPU MS6_CTL: PC_MASK_15_TO_1 (Bitfield-Mask: 0x7fff)*/
/* ===================================================  PROT_SMPU.MS7_CTL  =================================================== */
#define PROT_SMPU_MS7_CTL_P_Pos           (0UL)                 /*!< PROT_SMPU MS7_CTL: P (Bit 0)                              */
#define PROT_SMPU_MS7_CTL_P_Msk           (0x1UL)               /*!< PROT_SMPU MS7_CTL: P (Bitfield-Mask: 0x01)                */
#define PROT_SMPU_MS7_CTL_NS_Pos          (1UL)                 /*!< PROT_SMPU MS7_CTL: NS (Bit 1)                             */
#define PROT_SMPU_MS7_CTL_NS_Msk          (0x2UL)               /*!< PROT_SMPU MS7_CTL: NS (Bitfield-Mask: 0x01)               */
#define PROT_SMPU_MS7_CTL_PRIO_Pos        (8UL)                 /*!< PROT_SMPU MS7_CTL: PRIO (Bit 8)                           */
#define PROT_SMPU_MS7_CTL_PRIO_Msk        (0x300UL)             /*!< PROT_SMPU MS7_CTL: PRIO (Bitfield-Mask: 0x03)             */
#define PROT_SMPU_MS7_CTL_PC_MASK_0_Pos   (16UL)                /*!< PROT_SMPU MS7_CTL: PC_MASK_0 (Bit 16)                     */
#define PROT_SMPU_MS7_CTL_PC_MASK_0_Msk   (0x10000UL)           /*!< PROT_SMPU MS7_CTL: PC_MASK_0 (Bitfield-Mask: 0x01)        */
#define PROT_SMPU_MS7_CTL_PC_MASK_15_TO_1_Pos (17UL)            /*!< PROT_SMPU MS7_CTL: PC_MASK_15_TO_1 (Bit 17)               */
#define PROT_SMPU_MS7_CTL_PC_MASK_15_TO_1_Msk (0xfffe0000UL)    /*!< PROT_SMPU MS7_CTL: PC_MASK_15_TO_1 (Bitfield-Mask: 0x7fff)*/
/* ===================================================  PROT_SMPU.MS8_CTL  =================================================== */
#define PROT_SMPU_MS8_CTL_P_Pos           (0UL)                 /*!< PROT_SMPU MS8_CTL: P (Bit 0)                              */
#define PROT_SMPU_MS8_CTL_P_Msk           (0x1UL)               /*!< PROT_SMPU MS8_CTL: P (Bitfield-Mask: 0x01)                */
#define PROT_SMPU_MS8_CTL_NS_Pos          (1UL)                 /*!< PROT_SMPU MS8_CTL: NS (Bit 1)                             */
#define PROT_SMPU_MS8_CTL_NS_Msk          (0x2UL)               /*!< PROT_SMPU MS8_CTL: NS (Bitfield-Mask: 0x01)               */
#define PROT_SMPU_MS8_CTL_PRIO_Pos        (8UL)                 /*!< PROT_SMPU MS8_CTL: PRIO (Bit 8)                           */
#define PROT_SMPU_MS8_CTL_PRIO_Msk        (0x300UL)             /*!< PROT_SMPU MS8_CTL: PRIO (Bitfield-Mask: 0x03)             */
#define PROT_SMPU_MS8_CTL_PC_MASK_0_Pos   (16UL)                /*!< PROT_SMPU MS8_CTL: PC_MASK_0 (Bit 16)                     */
#define PROT_SMPU_MS8_CTL_PC_MASK_0_Msk   (0x10000UL)           /*!< PROT_SMPU MS8_CTL: PC_MASK_0 (Bitfield-Mask: 0x01)        */
#define PROT_SMPU_MS8_CTL_PC_MASK_15_TO_1_Pos (17UL)            /*!< PROT_SMPU MS8_CTL: PC_MASK_15_TO_1 (Bit 17)               */
#define PROT_SMPU_MS8_CTL_PC_MASK_15_TO_1_Msk (0xfffe0000UL)    /*!< PROT_SMPU MS8_CTL: PC_MASK_15_TO_1 (Bitfield-Mask: 0x7fff)*/
/* ===================================================  PROT_SMPU.MS9_CTL  =================================================== */
#define PROT_SMPU_MS9_CTL_P_Pos           (0UL)                 /*!< PROT_SMPU MS9_CTL: P (Bit 0)                              */
#define PROT_SMPU_MS9_CTL_P_Msk           (0x1UL)               /*!< PROT_SMPU MS9_CTL: P (Bitfield-Mask: 0x01)                */
#define PROT_SMPU_MS9_CTL_NS_Pos          (1UL)                 /*!< PROT_SMPU MS9_CTL: NS (Bit 1)                             */
#define PROT_SMPU_MS9_CTL_NS_Msk          (0x2UL)               /*!< PROT_SMPU MS9_CTL: NS (Bitfield-Mask: 0x01)               */
#define PROT_SMPU_MS9_CTL_PRIO_Pos        (8UL)                 /*!< PROT_SMPU MS9_CTL: PRIO (Bit 8)                           */
#define PROT_SMPU_MS9_CTL_PRIO_Msk        (0x300UL)             /*!< PROT_SMPU MS9_CTL: PRIO (Bitfield-Mask: 0x03)             */
#define PROT_SMPU_MS9_CTL_PC_MASK_0_Pos   (16UL)                /*!< PROT_SMPU MS9_CTL: PC_MASK_0 (Bit 16)                     */
#define PROT_SMPU_MS9_CTL_PC_MASK_0_Msk   (0x10000UL)           /*!< PROT_SMPU MS9_CTL: PC_MASK_0 (Bitfield-Mask: 0x01)        */
#define PROT_SMPU_MS9_CTL_PC_MASK_15_TO_1_Pos (17UL)            /*!< PROT_SMPU MS9_CTL: PC_MASK_15_TO_1 (Bit 17)               */
#define PROT_SMPU_MS9_CTL_PC_MASK_15_TO_1_Msk (0xfffe0000UL)    /*!< PROT_SMPU MS9_CTL: PC_MASK_15_TO_1 (Bitfield-Mask: 0x7fff)*/
/* ==================================================  PROT_SMPU.MS10_CTL  =================================================== */
#define PROT_SMPU_MS10_CTL_P_Pos          (0UL)                 /*!< PROT_SMPU MS10_CTL: P (Bit 0)                             */
#define PROT_SMPU_MS10_CTL_P_Msk          (0x1UL)               /*!< PROT_SMPU MS10_CTL: P (Bitfield-Mask: 0x01)               */
#define PROT_SMPU_MS10_CTL_NS_Pos         (1UL)                 /*!< PROT_SMPU MS10_CTL: NS (Bit 1)                            */
#define PROT_SMPU_MS10_CTL_NS_Msk         (0x2UL)               /*!< PROT_SMPU MS10_CTL: NS (Bitfield-Mask: 0x01)              */
#define PROT_SMPU_MS10_CTL_PRIO_Pos       (8UL)                 /*!< PROT_SMPU MS10_CTL: PRIO (Bit 8)                          */
#define PROT_SMPU_MS10_CTL_PRIO_Msk       (0x300UL)             /*!< PROT_SMPU MS10_CTL: PRIO (Bitfield-Mask: 0x03)            */
#define PROT_SMPU_MS10_CTL_PC_MASK_0_Pos  (16UL)                /*!< PROT_SMPU MS10_CTL: PC_MASK_0 (Bit 16)                    */
#define PROT_SMPU_MS10_CTL_PC_MASK_0_Msk  (0x10000UL)           /*!< PROT_SMPU MS10_CTL: PC_MASK_0 (Bitfield-Mask: 0x01)       */
#define PROT_SMPU_MS10_CTL_PC_MASK_15_TO_1_Pos (17UL)           /*!< PROT_SMPU MS10_CTL: PC_MASK_15_TO_1 (Bit 17)              */
#define PROT_SMPU_MS10_CTL_PC_MASK_15_TO_1_Msk (0xfffe0000UL)   /*!< PROT_SMPU MS10_CTL: PC_MASK_15_TO_1 (Bitfield-Mask: 0x7fff)*/
/* ==================================================  PROT_SMPU.MS11_CTL  =================================================== */
#define PROT_SMPU_MS11_CTL_P_Pos          (0UL)                 /*!< PROT_SMPU MS11_CTL: P (Bit 0)                             */
#define PROT_SMPU_MS11_CTL_P_Msk          (0x1UL)               /*!< PROT_SMPU MS11_CTL: P (Bitfield-Mask: 0x01)               */
#define PROT_SMPU_MS11_CTL_NS_Pos         (1UL)                 /*!< PROT_SMPU MS11_CTL: NS (Bit 1)                            */
#define PROT_SMPU_MS11_CTL_NS_Msk         (0x2UL)               /*!< PROT_SMPU MS11_CTL: NS (Bitfield-Mask: 0x01)              */
#define PROT_SMPU_MS11_CTL_PRIO_Pos       (8UL)                 /*!< PROT_SMPU MS11_CTL: PRIO (Bit 8)                          */
#define PROT_SMPU_MS11_CTL_PRIO_Msk       (0x300UL)             /*!< PROT_SMPU MS11_CTL: PRIO (Bitfield-Mask: 0x03)            */
#define PROT_SMPU_MS11_CTL_PC_MASK_0_Pos  (16UL)                /*!< PROT_SMPU MS11_CTL: PC_MASK_0 (Bit 16)                    */
#define PROT_SMPU_MS11_CTL_PC_MASK_0_Msk  (0x10000UL)           /*!< PROT_SMPU MS11_CTL: PC_MASK_0 (Bitfield-Mask: 0x01)       */
#define PROT_SMPU_MS11_CTL_PC_MASK_15_TO_1_Pos (17UL)           /*!< PROT_SMPU MS11_CTL: PC_MASK_15_TO_1 (Bit 17)              */
#define PROT_SMPU_MS11_CTL_PC_MASK_15_TO_1_Msk (0xfffe0000UL)   /*!< PROT_SMPU MS11_CTL: PC_MASK_15_TO_1 (Bitfield-Mask: 0x7fff)*/
/* ==================================================  PROT_SMPU.MS12_CTL  =================================================== */
#define PROT_SMPU_MS12_CTL_P_Pos          (0UL)                 /*!< PROT_SMPU MS12_CTL: P (Bit 0)                             */
#define PROT_SMPU_MS12_CTL_P_Msk          (0x1UL)               /*!< PROT_SMPU MS12_CTL: P (Bitfield-Mask: 0x01)               */
#define PROT_SMPU_MS12_CTL_NS_Pos         (1UL)                 /*!< PROT_SMPU MS12_CTL: NS (Bit 1)                            */
#define PROT_SMPU_MS12_CTL_NS_Msk         (0x2UL)               /*!< PROT_SMPU MS12_CTL: NS (Bitfield-Mask: 0x01)              */
#define PROT_SMPU_MS12_CTL_PRIO_Pos       (8UL)                 /*!< PROT_SMPU MS12_CTL: PRIO (Bit 8)                          */
#define PROT_SMPU_MS12_CTL_PRIO_Msk       (0x300UL)             /*!< PROT_SMPU MS12_CTL: PRIO (Bitfield-Mask: 0x03)            */
#define PROT_SMPU_MS12_CTL_PC_MASK_0_Pos  (16UL)                /*!< PROT_SMPU MS12_CTL: PC_MASK_0 (Bit 16)                    */
#define PROT_SMPU_MS12_CTL_PC_MASK_0_Msk  (0x10000UL)           /*!< PROT_SMPU MS12_CTL: PC_MASK_0 (Bitfield-Mask: 0x01)       */
#define PROT_SMPU_MS12_CTL_PC_MASK_15_TO_1_Pos (17UL)           /*!< PROT_SMPU MS12_CTL: PC_MASK_15_TO_1 (Bit 17)              */
#define PROT_SMPU_MS12_CTL_PC_MASK_15_TO_1_Msk (0xfffe0000UL)   /*!< PROT_SMPU MS12_CTL: PC_MASK_15_TO_1 (Bitfield-Mask: 0x7fff)*/
/* ==================================================  PROT_SMPU.MS13_CTL  =================================================== */
#define PROT_SMPU_MS13_CTL_P_Pos          (0UL)                 /*!< PROT_SMPU MS13_CTL: P (Bit 0)                             */
#define PROT_SMPU_MS13_CTL_P_Msk          (0x1UL)               /*!< PROT_SMPU MS13_CTL: P (Bitfield-Mask: 0x01)               */
#define PROT_SMPU_MS13_CTL_NS_Pos         (1UL)                 /*!< PROT_SMPU MS13_CTL: NS (Bit 1)                            */
#define PROT_SMPU_MS13_CTL_NS_Msk         (0x2UL)               /*!< PROT_SMPU MS13_CTL: NS (Bitfield-Mask: 0x01)              */
#define PROT_SMPU_MS13_CTL_PRIO_Pos       (8UL)                 /*!< PROT_SMPU MS13_CTL: PRIO (Bit 8)                          */
#define PROT_SMPU_MS13_CTL_PRIO_Msk       (0x300UL)             /*!< PROT_SMPU MS13_CTL: PRIO (Bitfield-Mask: 0x03)            */
#define PROT_SMPU_MS13_CTL_PC_MASK_0_Pos  (16UL)                /*!< PROT_SMPU MS13_CTL: PC_MASK_0 (Bit 16)                    */
#define PROT_SMPU_MS13_CTL_PC_MASK_0_Msk  (0x10000UL)           /*!< PROT_SMPU MS13_CTL: PC_MASK_0 (Bitfield-Mask: 0x01)       */
#define PROT_SMPU_MS13_CTL_PC_MASK_15_TO_1_Pos (17UL)           /*!< PROT_SMPU MS13_CTL: PC_MASK_15_TO_1 (Bit 17)              */
#define PROT_SMPU_MS13_CTL_PC_MASK_15_TO_1_Msk (0xfffe0000UL)   /*!< PROT_SMPU MS13_CTL: PC_MASK_15_TO_1 (Bitfield-Mask: 0x7fff)*/
/* ==================================================  PROT_SMPU.MS14_CTL  =================================================== */
#define PROT_SMPU_MS14_CTL_P_Pos          (0UL)                 /*!< PROT_SMPU MS14_CTL: P (Bit 0)                             */
#define PROT_SMPU_MS14_CTL_P_Msk          (0x1UL)               /*!< PROT_SMPU MS14_CTL: P (Bitfield-Mask: 0x01)               */
#define PROT_SMPU_MS14_CTL_NS_Pos         (1UL)                 /*!< PROT_SMPU MS14_CTL: NS (Bit 1)                            */
#define PROT_SMPU_MS14_CTL_NS_Msk         (0x2UL)               /*!< PROT_SMPU MS14_CTL: NS (Bitfield-Mask: 0x01)              */
#define PROT_SMPU_MS14_CTL_PRIO_Pos       (8UL)                 /*!< PROT_SMPU MS14_CTL: PRIO (Bit 8)                          */
#define PROT_SMPU_MS14_CTL_PRIO_Msk       (0x300UL)             /*!< PROT_SMPU MS14_CTL: PRIO (Bitfield-Mask: 0x03)            */
#define PROT_SMPU_MS14_CTL_PC_MASK_0_Pos  (16UL)                /*!< PROT_SMPU MS14_CTL: PC_MASK_0 (Bit 16)                    */
#define PROT_SMPU_MS14_CTL_PC_MASK_0_Msk  (0x10000UL)           /*!< PROT_SMPU MS14_CTL: PC_MASK_0 (Bitfield-Mask: 0x01)       */
#define PROT_SMPU_MS14_CTL_PC_MASK_15_TO_1_Pos (17UL)           /*!< PROT_SMPU MS14_CTL: PC_MASK_15_TO_1 (Bit 17)              */
#define PROT_SMPU_MS14_CTL_PC_MASK_15_TO_1_Msk (0xfffe0000UL)   /*!< PROT_SMPU MS14_CTL: PC_MASK_15_TO_1 (Bitfield-Mask: 0x7fff)*/
/* ==================================================  PROT_SMPU.MS15_CTL  =================================================== */
#define PROT_SMPU_MS15_CTL_P_Pos          (0UL)                 /*!< PROT_SMPU MS15_CTL: P (Bit 0)                             */
#define PROT_SMPU_MS15_CTL_P_Msk          (0x1UL)               /*!< PROT_SMPU MS15_CTL: P (Bitfield-Mask: 0x01)               */
#define PROT_SMPU_MS15_CTL_NS_Pos         (1UL)                 /*!< PROT_SMPU MS15_CTL: NS (Bit 1)                            */
#define PROT_SMPU_MS15_CTL_NS_Msk         (0x2UL)               /*!< PROT_SMPU MS15_CTL: NS (Bitfield-Mask: 0x01)              */
#define PROT_SMPU_MS15_CTL_PRIO_Pos       (8UL)                 /*!< PROT_SMPU MS15_CTL: PRIO (Bit 8)                          */
#define PROT_SMPU_MS15_CTL_PRIO_Msk       (0x300UL)             /*!< PROT_SMPU MS15_CTL: PRIO (Bitfield-Mask: 0x03)            */
#define PROT_SMPU_MS15_CTL_PC_MASK_0_Pos  (16UL)                /*!< PROT_SMPU MS15_CTL: PC_MASK_0 (Bit 16)                    */
#define PROT_SMPU_MS15_CTL_PC_MASK_0_Msk  (0x10000UL)           /*!< PROT_SMPU MS15_CTL: PC_MASK_0 (Bitfield-Mask: 0x01)       */
#define PROT_SMPU_MS15_CTL_PC_MASK_15_TO_1_Pos (17UL)           /*!< PROT_SMPU MS15_CTL: PC_MASK_15_TO_1 (Bit 17)              */
#define PROT_SMPU_MS15_CTL_PC_MASK_15_TO_1_Msk (0xfffe0000UL)   /*!< PROT_SMPU MS15_CTL: PC_MASK_15_TO_1 (Bitfield-Mask: 0x7fff)*/


