ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_prot.h
/* ===============================================  PROT_MPU_MPU_STRUCT.ADDR  ================================================ */
#define PROT_MPU_MPU_STRUCT_ADDR_SUBREGION_DISABLE_Pos (0UL)    /*!< PROT_MPU_MPU_STRUCT ADDR: SUBREGION_DISABLE (Bit 0)       */
#define PROT_MPU_MPU_STRUCT_ADDR_SUBREGION_DISABLE_Msk (0xffUL) /*!< PROT_MPU_MPU_STRUCT ADDR: SUBREGION_DISABLE (Bitfield-Mask: 0xff)*/
#define PROT_MPU_MPU_STRUCT_ADDR_ADDR24_Pos (8UL)               /*!< PROT_MPU_MPU_STRUCT ADDR: ADDR24 (Bit 8)                  */
#define PROT_MPU_MPU_STRUCT_ADDR_ADDR24_Msk (0xffffff00UL)      /*!< PROT_MPU_MPU_STRUCT ADDR: ADDR24 (Bitfield-Mask: 0xffffff)*/
/* ================================================  PROT_MPU_MPU_STRUCT.ATT  ================================================ */
#define PROT_MPU_MPU_STRUCT_ATT_UR_Pos    (0UL)                 /*!< PROT_MPU_MPU_STRUCT ATT: UR (Bit 0)                       */
#define PROT_MPU_MPU_STRUCT_ATT_UR_Msk    (0x1UL)               /*!< PROT_MPU_MPU_STRUCT ATT: UR (Bitfield-Mask: 0x01)         */
#define PROT_MPU_MPU_STRUCT_ATT_UW_Pos    (1UL)                 /*!< PROT_MPU_MPU_STRUCT ATT: UW (Bit 1)                       */
#define PROT_MPU_MPU_STRUCT_ATT_UW_Msk    (0x2UL)               /*!< PROT_MPU_MPU_STRUCT ATT: UW (Bitfield-Mask: 0x01)         */
#define PROT_MPU_MPU_STRUCT_ATT_UX_Pos    (2UL)                 /*!< PROT_MPU_MPU_STRUCT ATT: UX (Bit 2)                       */
#define PROT_MPU_MPU_STRUCT_ATT_UX_Msk    (0x4UL)               /*!< PROT_MPU_MPU_STRUCT ATT: UX (Bitfield-Mask: 0x01)         */
#define PROT_MPU_MPU_STRUCT_ATT_PR_Pos    (3UL)                 /*!< PROT_MPU_MPU_STRUCT ATT: PR (Bit 3)                       */
#define PROT_MPU_MPU_STRUCT_ATT_PR_Msk    (0x8UL)               /*!< PROT_MPU_MPU_STRUCT ATT: PR (Bitfield-Mask: 0x01)         */
#define PROT_MPU_MPU_STRUCT_ATT_PW_Pos    (4UL)                 /*!< PROT_MPU_MPU_STRUCT ATT: PW (Bit 4)                       */
#define PROT_MPU_MPU_STRUCT_ATT_PW_Msk    (0x10UL)              /*!< PROT_MPU_MPU_STRUCT ATT: PW (Bitfield-Mask: 0x01)         */
#define PROT_MPU_MPU_STRUCT_ATT_PX_Pos    (5UL)                 /*!< PROT_MPU_MPU_STRUCT ATT: PX (Bit 5)                       */
#define PROT_MPU_MPU_STRUCT_ATT_PX_Msk    (0x20UL)              /*!< PROT_MPU_MPU_STRUCT ATT: PX (Bitfield-Mask: 0x01)         */
#define PROT_MPU_MPU_STRUCT_ATT_NS_Pos    (6UL)                 /*!< PROT_MPU_MPU_STRUCT ATT: NS (Bit 6)                       */
#define PROT_MPU_MPU_STRUCT_ATT_NS_Msk    (0x40UL)              /*!< PROT_MPU_MPU_STRUCT ATT: NS (Bitfield-Mask: 0x01)         */
#define PROT_MPU_MPU_STRUCT_ATT_REGION_SIZE_Pos (24UL)          /*!< PROT_MPU_MPU_STRUCT ATT: REGION_SIZE (Bit 24)             */
#define PROT_MPU_MPU_STRUCT_ATT_REGION_SIZE_Msk (0x1f000000UL)  /*!< PROT_MPU_MPU_STRUCT ATT: REGION_SIZE (Bitfield-Mask: 0x1f)*/
#define PROT_MPU_MPU_STRUCT_ATT_ENABLED_Pos (31UL)              /*!< PROT_MPU_MPU_STRUCT ATT: ENABLED (Bit 31)                 */
#define PROT_MPU_MPU_STRUCT_ATT_ENABLED_Msk (0x80000000UL)      /*!< PROT_MPU_MPU_STRUCT ATT: ENABLED (Bitfield-Mask: 0x01)    */


/* ====================================================  PROT_MPU.MS_CTL  ==================================================== */
#define PROT_MPU_MS_CTL_PC_Pos            (0UL)                 /*!< PROT_MPU MS_CTL: PC (Bit 0)                               */
#define PROT_MPU_MS_CTL_PC_Msk            (0xfUL)               /*!< PROT_MPU MS_CTL: PC (Bitfield-Mask: 0x0f)                 */
#define PROT_MPU_MS_CTL_PC_SAVED_Pos      (16UL)                /*!< PROT_MPU MS_CTL: PC_SAVED (Bit 16)                        */
#define PROT_MPU_MS_CTL_PC_SAVED_Msk      (0xf0000UL)           /*!< PROT_MPU MS_CTL: PC_SAVED (Bitfield-Mask: 0x0f)           */


#endif /* _CYIP_PROT_H_ */


/* [] END OF FILE */
